Update state diagram. Use Mermaid instead of PlantUML
